<?php

namespace app\helpers;

use Yii;

/**
 * GeographyLists - справочники географических данных (национальности, гражданство)
 */
class GeographyLists
{
    /**
     * Список национальностей
     * @return array
     */
    public static function getNationality(): array
    {
        return [
            1 => Yii::t('main', 'Русский/Русская'),
            2 => Yii::t('main', 'Казах/Казашка'),
            100 => Yii::t('main', 'Кореец/Кореянка'),
            101 => Yii::t('main', 'Немец/Немка'),
            103 => Yii::t('main', 'Украинец/Украинка'),
            104 => Yii::t('main', 'Татарин/Татарка'),
            105 => Yii::t('main', 'Киргиз/Киргизка'),
            106 => Yii::t('main', 'Узбек/Узбечка'),
            107 => Yii::t('main', 'Уйгур/Уйгурка'),
            108 => Yii::t('main', 'Туркмен/Туркменка'),
            109 => Yii::t('main', 'Азербайджанин/Азербайджанка'),
            110 => Yii::t('main', 'Чеченец/Чеченка'),
            111 => Yii::t('main', 'Грузин/Грузинка'),
            112 => Yii::t('main', 'Таджик/Таджичка'),
            116 => Yii::t('main', 'Ингуш/Ингушка'),
            120 => Yii::t('main', 'Осетин/Осетинка'),
            121 => Yii::t('main', 'Кистинец/Кистинка'),
            122 => Yii::t('main', 'Грек/Гречанка'),
            124 => Yii::t('main', 'Армянин/Армянка'),
            118 => Yii::t('main', 'Поляк/Полька'),
            114 => Yii::t('main', 'Дунганец/Дунганка'),
            131 => Yii::t('main', 'Чуваш/Чувашка'),
            132 => Yii::t('main', 'Лезгин/Лезгинка'),
            130 => Yii::t('main', 'Еврей/Еврейка'),
            139 => Yii::t('main', 'Латчик,Латчик'),
            3 => Yii::t('main', 'Чех/Чешка'),
            140 => Yii::t('main', 'Араб/Арабка'),
            123 => Yii::t('main', 'Молдован/Молдованка'),
            143 => Yii::t('main', 'Удмурт/Удмуртка'),
            144 => Yii::t('main', 'Венгр/Венгерка'),
            146 => Yii::t('main', 'Латыш/Латышка'),
            147 => Yii::t('main', 'Калмык/Калмычка'),
            148 => Yii::t('main', 'Карел/Карелка'),
            149 => Yii::t('main', 'Хакас/Хакаска'),
            142 => Yii::t('main', 'Каракалпак/Каракалпачка'),
            113 => Yii::t('main', 'Башкир/Башкирка'),
            141 => Yii::t('main', 'Финн/Финка'),
            117 => Yii::t('main', 'Поляк/Полячка'),
            200 => Yii::t('main', 'Не указана,'),
            115 => Yii::t('main', 'Монгол/Монголка'),
            125 => Yii::t('main', 'Мариец/Марийка'),
            127 => Yii::t('main', 'Литовец/Литовка'),
            128 => Yii::t('main', 'Китаец/Китаянка'),
            129 => Yii::t('main', 'Цыган/Цыганка'),
            133 => Yii::t('main', 'Итальянец/Итальянка'),
            134 => Yii::t('main', 'Болгарин/Болгарка'),
            135 => Yii::t('main', 'Эстонец/Эстонка'),
            137 => Yii::t('main', 'Турок/Турчанка'),
            138 => Yii::t('main', 'Аварец/Аварка'),
            145 => Yii::t('main', 'Японец/Японка'),
            126 => Yii::t('main', 'Мордвин/Мордовка'),
            4 => Yii::t('main', 'Белорус/Белорусска'),
            102 => Yii::t('main', 'Украинец/Украинка'),
            150 => Yii::t('main', 'Француз/Француженка'),
            170 => Yii::t('main', 'Афганец/Афганка'),
            171 => Yii::t('main', 'Иранец/Иранка'),
            172 => Yii::t('main', 'Индус/Индуска'),
            177 => Yii::t('main', 'Курд/Курдянка'),
            151 => Yii::t('main', 'Гагауз,Гагауз'),
            178 => Yii::t('main', 'Ассириец/Ассирийка'),
            201 => Yii::t('main', 'Ногаец/Ногайка'),
            202 => Yii::t('main', 'Даргин/Даргинка'),
            203 => Yii::t('main', 'Румын/Румынка'),
            204 => Yii::t('main', 'Кумык/Кумычка'),
        ];
    }

    /**
     * Статусы гражданства
     * @return array
     */
    public static function getCitizenshipStatus(): array
    {
        return [
            1 => Yii::t('main', 'Гражданин РК'),
            2 => Yii::t('main', 'Иностранец'),
            3 => Yii::t('main', 'Лицо без гражданства'),
            4 => Yii::t('main', 'Беженец'),
            5 => Yii::t('main', 'Лицо, ищущее убежище'),
            6 => Yii::t('main', 'Оралман'),
        ];
    }
}
